In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
mov = pd.read_csv('../Sample_data/movimenti.csv', sep=';')
mov.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 441689 entries, 0 to 441688
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   cognome  441689 non-null  object
 1   nome     441689 non-null  object
 2   data     441689 non-null  object
 3   importo  441689 non-null  int64
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [3]:
mov.head(3)

      cognome      nome                 data  importo
0      Angeli     Guido  2000/01/01 16:04:41     -962
1    Beruschi    Enrico  2000/01/01 21:18:57     -551
2  Pellegrini  Federica  2000/01/01 20:43:37      765

## Chi sono le 3 persone con saldo maggiore?

In [4]:
mov.groupby(['cognome','nome']).sum('importo').sort_values('importo', ascending=False).head(3)

                   importo
cognome  nome
Hunziker Michelle   964038
Cracco   Carlo      596540
Mauro    Massimo    543466

# Chi sono le 3 persone con saldo minore?

In [18]:
mov.groupby(['cognome','nome']).sum('importo').sort_values('importo').head(3)

                   importo
cognome   nome
Frassica  Nino    -1510579
Forest    Mago    -1461235
Pappagone Gaetano -1020620

# Calcolare importo totale movimentato per ciascun anno

In [5]:
mov['data'] = pd.to_datetime(mov['data'])
mov.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 441689 entries, 0 to 441688
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   cognome  441689 non-null  object
 1   nome     441689 non-null  object
 2   data     441689 non-null  datetime64[ns]
 3   importo  441689 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 13.5+ MB

In [6]:
anni = pd.to_datetime(mov['data']).dt.year
anni

0         2000
1         2000
2         2000
3         2000
4         2000
          ...
441684    2022
441685    2022
441686    2022
441687    2022
441688    2022
Name: data, Length: 441689, dtype: int32

In [8]:
mov_anni = pd.DataFrame({'Anno':anni, 'Importo':mov['importo']})
mov_anni.head()

   Anno  Importo
0  2000     -962
1  2000     -551
2  2000      765
3  2000     -804
4  2000     -428

In [9]:
mov_anni.groupby(['Anno']).sum('Importo').sort_values('Anno')

      Importo
Anno
2000  -566590
2001  -777694
2002 -2309291
2003 -3797983
2004  -369603
2005  -700867
2006  -747417
2007 -1770298
2008 -1016101
2009 -1076864
2010 -1411229
2011 -1485210
2012  -495176
2013   383456
2014 -1135507
2015  -313765
2016   368199
2017 -1336761
2018 -3037119
2019 -1153415
2020 -1140018
2021   215311
2022  -152154

# Operazioni al di sopra dei 50k €

In [10]:
mov['importo']>50000

0         False
1         False
2         False
3         False
4         False
          ...
441684    False
441685    False
441686    False
441687    False
441688    False
Name: importo, Length: 441689, dtype: bool

In [11]:
mov[mov['importo']>50000]

        cognome      nome                data  importo
2087     Cracco     Carlo 2000-02-04 17:05:58    92937
3135   Hunziker  Michelle 2000-02-26 01:06:28   452022
3529   Hunziker  Michelle 2000-03-04 00:27:51    55290
8893   Hunziker  Michelle 2000-06-11 01:57:46    53240
38918  Hunziker  Michelle 2001-12-27 04:16:00    55231
39160  Hunziker  Michelle 2001-12-31 01:07:49    69879

# Segnalare operazioni sospette

In [12]:
persona_con_saldo_maggiore = mov.groupby(['cognome','nome']).sum('importo').sort_values('importo', ascending=False).head(1)
persona_con_saldo_maggiore

                   importo
cognome  nome
Hunziker Michelle   964038

Estraggo solo i movimenti di Michelle Hunziker

In [20]:
movimenti_michelle = mov[mov['cognome']=='Hunziker']
movimenti_michelle

         cognome      nome                data  importo
188     Hunziker  Michelle 2000-01-04 19:22:31     -879
414     Hunziker  Michelle 2000-01-06 22:33:29     -917
496     Hunziker  Michelle 2000-01-08 22:17:12     -568
532     Hunziker  Michelle 2000-01-10 02:06:43    -3345
619     Hunziker  Michelle 2000-01-10 21:28:10      351
...          ...       ...                 ...      ...
441353  Hunziker  Michelle 2022-03-08 15:26:29     -922
441374  Hunziker  Michelle 2022-03-10 05:46:10      172
441416  Hunziker  Michelle 2022-03-09 16:15:40      326
441481  Hunziker  Michelle 2022-03-10 17:30:40     -556
441528  Hunziker  Michelle 2022-03-10 17:51:04      385

[4082 rows x 4 columns]

Ne calcolo la media

In [25]:
avg_michelle = movimenti_michelle['importo'].mean()
avg_michelle

236.16805487506124

Movimenti oltre 10 volte importo medio

In [29]:
movimenti_michelle[movimenti_michelle['importo']>(avg_michelle*10)]

         cognome      nome                data  importo
2334    Hunziker  Michelle 2000-02-09 18:54:57    36693
3135    Hunziker  Michelle 2000-02-26 01:06:28   452022
3409    Hunziker  Michelle 2000-03-01 01:32:03    18720
3529    Hunziker  Michelle 2000-03-04 00:27:51    55290
3999    Hunziker  Michelle 2000-03-12 05:38:41     6287
...          ...       ...                 ...      ...
435705  Hunziker  Michelle 2021-11-28 01:09:23     9359
436293  Hunziker  Michelle 2021-12-07 03:33:41     2575
436657  Hunziker  Michelle 2021-12-13 19:36:51     3906
437453  Hunziker  Michelle 2021-12-30 05:53:35     8945
437938  Hunziker  Michelle 2022-01-08 01:48:08     2967

[563 rows x 4 columns]

In [30]:
# movimenti_michelle.to_csv('movi_mic.csv')